OpenFOAM/snappyMultiRegionHeater/constant/topAir/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/topAir/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

8
(
    maxY
    {
        type            wall;
        inGroups        1(wall);
        nFaces          300;
        startFace       9320;
    }
    minX
    {
        type            patch;
        nFaces          70;
        startFace       9620;
    }
    maxX
    {
        type            patch;
        nFaces          70;
        startFace       9690;
    }
    minZ
    {
        type            wall;
        inGroups        1(wall);
        nFaces          210;
        startFace       9760;
    }
    maxZ
    {
        type            wall;
        inGroups        1(wall);
        nFaces          210;
        startFace       9970;
    }
    topAir_to_rightSolid
    {
        type            mappedWall;
        inGroups        1(wall);
        nFaces          520;
        startFace       10180;
        sampleMode      nearestPatchFace;
        sampleRegion    rightSolid;
        samplePatch     rightSolid_to_topAir;
    }
    topAir_to_heater
    {
        type            mappedWall;
        inGroups        1(wall);
        nFaces          160;
        startFace       10700;
        sampleMode      nearestPatchFace;
        sampleRegion    heater;
        samplePatch     heater_to_topAir;
    }
    topAir_to_leftSolid
    {
        type            mappedWall;
        inGroups        1(wall);
        nFaces          520;
        startFace       10860;
        sampleMode      nearestPatchFace;
        sampleRegion    leftSolid;
        samplePatch     leftSolid_to_topAir;
    }
)

// ************************************************************************* //
